//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************

//******************************************************************************
// [File] XCradleChsSecureBoot.uni
// [Description] Add XCradle Chinese STR define in this file
// [Author] JSY-ZZP
// [Date] 2021/02/25
//******************************************************************************
/=#
#langdef   x-AMI "x-AMI"
#langdef   en-US "English"
#langdef   zh-chs "中文 (简体)"

#string SECURE_BOOT_MENU_FORM_TITLE     #language zh-chs "安全启动"
#string SECURE_BOOT_MENU_FORM_HELP      #language zh-chs "定制化的安全启动设置"
#string STR_PLATFORM_MODE               #language zh-chs "系统模式"
#string STR_SETUP                       #language zh-chs "设定"
#string STR_USER                        #language zh-chs "用户"
#string STR_AUDIT                       #language zh-chs "审计"。
#string STR_DEPLOYED                    #language zh-chs "已部署"
#string STR_VENDOR_KEYS_MODE            #language zh-chs "供应商密钥"
#string STR_VALID                       #language zh-chs "有效"
#string STR_MODIFIED                    #language zh-chs "已修改"
#string STR_SECURE_BOOT_ENABLE          #language zh-chs "尝试安全启动"
#string STR_SECURE_BOOT_HELP            #language zh-chs "如果安全启动被启用,安全启动特性将被激活，平台钥匙被登记并且系统处于用户模式\n，模式改变需要平台重置"
#string STR_ACTIVE                      #language zh-chs "激活"
#string STR_INACTIVE                    #language zh-chs "不激活"
#string STR_SECURE_BOOT_MODE            #language zh-chs "安全启动模式"
#string STR_SECURE_BOOT_MODE_HELP       #language zh-chs "安全启动模式选择。\n标准/自定义。'自定义'模式，\n变量配置不需要认证。"
#string SECURE_BOOT_STANDARD            #language zh-chs "标准"
#string SECURE_BOOT_CUSTOM              #language zh-chs "自定义"
#string STR_FORCE_AUDIT_MODE            #language zh-chs "进入审核模式"
#string STR_FORCE_AUDIT_MODE_HELP       #language zh-chs "进入审核模式工作流,从用户到审核,模式的转换将导致擦除PK变量"
#string STR_FORCE_DEPLOYED_MODE         #language zh-chs "进入部署模式"
#string STR_EXIT_DEPLOYED_MODE          #language zh-chs "离开部署模式"
#string STR_FORCE_DEPLOYED_MODE_HELP    #language zh-chs "在部署和用户模式之间转换"
#string STR_FORCE_SETUP_MODE            #language zh-chs "重置为设置模式"
#string STR_FORCE_SETUP_MODE_HELP       #language zh-chs "从NVRAM中删除所有的安全启动密钥数据库"
#string STR_FORCE_DEFAULT_MODE          #language zh-chs "恢复出厂密钥"
#string STR_FORCE_DEFAULT_MODE_HELP     #language zh-chs "强制系统进入用户模式。\n安装出厂默认的安全启动密钥数据库"
#string STR_KEY_MANAGEMENT_TITLE        #language zh-chs "密钥管理"
#string STR_KEY_MANAGEMENT_HELP         #language zh-chs "允许专家用户无需完全认证即可修改安全启动策略变量"
#string STR_DEFAULT_KEY_PROVISION_MODE  #language zh-chs "出厂密钥规定"
#string STR_KEY_PROVISION_MODE_HELP     #language zh-chs "平台重启后并且系统处于设置模式时安装出厂默认的安全启动密钥"
#string STR_DEVICE_GUARD_READY          #language zh-chs "设备防护已准备"
#string STR_REMOVE_UEFI_CA_FROM_DB      #language zh-chs "从数据库中移除“UEFI CA”"
#string STR_REMOVE_UEFI_CA_FROM_DB_HELP #language zh-chs "支持设备防护的系统不得在授权签名者数据库中列出“Mircrosoft UEFI CA” 证书"
#string STR_RESTORE_DB_DEFAULTS         #language zh-chs "恢复数据库默认值"
#string STR_RESTORE_DB_DEFAULTS_HELP    #language zh-chs "恢复数据库变量为出厂默认值"
#string STR_ABSENT_KEY                  #language zh-chs "没有密钥"
#string STR_CUSTOM_KEY                  #language zh-chs "外部的"
#string STR_DEFAULT_KEY                 #language zh-chs "默认"
#string STR_MIXED_KEY                   #language zh-chs "混合的"
#string STR_AMI_TEST_KEY                #language zh-chs "测试(AMI)"
#string STR_GET_ALL_VARS                #language zh-chs "保存所有安全启动变量"
#string STR_GET_KEYS_HELP               #language zh-chs "保存NVRAM中关于安全启动策略变量到系统设备的根目录文件夹下的指定文件（EFI_SIGNATURE_LIST数据格式）"
#string STR_ENROLL_EFI_IMAGE            #language zh-chs "登记Efi镜像"
#string STR_ENROLL_EFI_IMAGE_HELP       #language zh-chs "允许镜像运行在安全启动模式。\n登记二进制的SHA256哈希算法到授权签名数据库(db)。"
#string STR_FILE_SYSTEM                 #language zh-chs   "选择一个文件系统"
#string STR_FILE_SELECT                 #language zh-chs   "选择文件"
#string STR_SECURE_KEY_INFO             #language zh-chs "细节"
#string STR_SAVE_VAR_DATA               #language zh-chs "输出"
#string STR_SECURE_SET                  #language zh-chs "设置新的"
#string STR_SECURE_APPEND               #language zh-chs "附加"
#string STR_SECURE_DELETE               #language zh-chs "擦除"
#string STR_KEY_UPDATE_HELP             #language zh-chs "注册出厂默认值或从文件加载证书：\n 1.公钥证书：\n  a）EFI_SIGNATURE\n  b)EFI_CERT_X509 (DER)\n  c)EFI_CERT_RSA2048 (bin)\n  d)EFI_CERT_SHAXXX\n 2.经过身份验证的UEFI变量\n 3.EFI PE/COFF镜像（SHA256）\n密钥路径：\n 出厂，拓展，混合"
#string STR_KEY_TITLE                   #language zh-chs "安全启动变量           | 大小| 密钥| 密钥来源"
#string STR_PK_TITLE_TEXT               #language zh-chs "平台密钥(PK)           "
#string STR_KEK_TITLE_TEXT              #language zh-chs "密钥交换密钥(KEK)      "
#string STR_DB_TITLE_TEXT               #language zh-chs "认证签名               "
#string STR_DBX_TITLE_TEXT              #language zh-chs "禁用签名               "
#string STR_DBT_TITLE_TEXT              #language zh-chs "认证时间戳             "
#string STR_DBR_TITLE_TEXT              #language zh-chs "OS恢复签名             "
#string STR_SECURE_BOOT_PROCEED_CANCEL  #language zh-chs "按'是'进行 ，'否' 取消"
#string STR_ENABLE_ERROR_MODE_TITLE     #language zh-chs "系统处于设置模式下!"
#string STR_ENABLE_ERROR_MODE           #language zh-chs "当系统处于用户模式下，安全启动会被启用。当注册平台密钥(PK)后重复这个操作。"
#string STR_CSM_LOAD_TITLE              #language zh-chs "警告：CSM 被加载！"
#string STR_CSM_LOAD                    #language zh-chs "在setup中禁用CSM。重启后确保UEFI 视频（GOP）驱动可运行，再执行这个操作"
#string STR_RESET_TO_SETUP              #language zh-chs   "删除所有的变量将会重启进入设定模式.需要执行这个过程吗?"
#string STR_LOAD_DEFAULT_VARS_TITLE     #language zh-chs "加载出厂默认值"
#string STR_VAR_UPDATE_LOCKED_TITLE     #language zh-chs "安全密钥更新被锁定"
#string STR_VAR_UPDATE_LOCKED           #language zh-chs "系统重启时再试一次"
#string STR_UPDATE_FROM_DEFAULTS        #language zh-chs "按'是'从默认厂商变量'%s'或者选择'否'从文件中加载"
#string STR_UPDATE_FROM_FILE            #language zh-chs "按'是'从来自%s的内容更新%s。"
#string STR_FAILED                      #language zh-chs "失败"
#string STR_SUCCESS                     #language zh-chs "成功"
#string STR_WRITE_ERROR_TITLE           #language zh-chs "写入文件时出现错误"
#string STR_SAVE_SEC_KEY_TITLE          #language zh-chs "保存安全密钥/数据库"
#string STR_SAVE_SEC_KEY                #language zh-chs " %d变量被保存到磁盘"
#string STR_DELETE_SEC_KEY_TITLE        #language zh-chs   "删除安全密钥/数据库"
#string STR_PK_DEL_WARNING              #language zh-chs "警告：去除'PK'将重置系统到设置/编辑模式"
#string STR_DELETE_SEC_KEY              #language zh-chs "确定要从NVRAM删除'%s'?"
#string STR_NO_VALID_FS_TITLE           #language zh-chs "没有有效的文件"
#string STR_NO_VALID_FS                 #language zh-chs "没有可获得的有效文件"
#string STR_NO_VALID_FILE_TITLE         #language zh-chs "文件清单"
#string STR_NO_VALID_FILE               #language zh-chs "在所选的文件系统中没有可用的有效文件"

//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************